{"/en/docs/amazon":{"title":"How to Extract and Analyze Amazon Headphone Reviews with Capalyze: A Step-by-Step Tutorial","data":{"introduction#Introduction":"Capalyze is an AI-powered data analytics agent that transforms how individuals and businesses collect and analyze web and spreadsheet-style data. It uniquely combines natural language commands with automated web scraping and smart analysis features, enabling anyone—from e-commerce professionals to content creators—to extract valuable insights with minimal technical knowledge.In this tutorial, we’ll walk you through how to use Capalyze to extract and analyze Amazon product reviews. Specifically, you’ll learn how to capture customer reviews for Amazon’s best-selling headphones and generate intelligent insights in just a few minutes.Whether you are in product research, market analysis, or simply exploring customer sentiment, Capalyze provides an end-to-end, no-code workflow that empowers data-driven decisions.\nThe following video fully demonstrates the steps in the tutorial","step-1-open-capalyze-and-start-a-new-conversation#Step 1: Open Capalyze and Start a New Conversation":"Go to https://capalyze.ai in your browser. Once you’re on the homepage, click to start a new conversation. In the chat box, type:\n\"Analysis of Amazon's best-selling headphones\"\nThen hit send. Capalyze will begin processing your request and prepare to extract relevant data from the web.","step-2-install-the-chrome-extension#Step 2: Install the Chrome Extension":"Capalyze uses a browser extension to enable intelligent data extraction. If this is your first time using it, you’ll be prompted to install the extension. Click “Go Install”, which will take you to the Chrome Web Store. Follow the standard installation steps.This extension is essential for enabling Capalyze to automatically scan web pages and identify extractable data.","step-3-automatic-pre-extraction-process#Step 3: Automatic Pre-Extraction Process":"After installation, the extension will automatically begin scanning the Amazon page related to best-selling headphones. Capalyze identifies key data points—such as product names, review counts, ratings, and product links—before you even hit the “Start Extraction” button.This automated pre-extraction helps ensure data quality and relevance.","step-4-start-the-data-extraction#Step 4: Start the Data Extraction":"Switch back to the Capalyze tab. You’ll now see a preview of the data that’s ready to be collected. If everything looks good, click “Start Extraction”, then confirm to initiate the full extraction process.Capalyze will now scrape the page, pulling in all the relevant review data in real time.","step-5-live-extraction-monitoring#Step 5: Live Extraction Monitoring":"As the extraction runs, customer reviews are continuously being collected, with the total number steadily increasing.This provides clear visibility into the process and helps ensure the results align with your expectations.","step-6-ai-powered-data-analysis#Step 6: AI-Powered Data Analysis":"Once extraction is complete, Capalyze immediately shifts into analysis mode. It will generate insights based on the collected data using AI-driven natural language processing.You’ll see a “thinking” indicator on screen as it processes multiple layers of insight.","step-7-explore-key-findings-analysis-and-recommendations#Step 7: Explore Key Findings, Analysis, and Recommendations":"Capalyze will output a detailed report, including:\nKey Findings: Highlights of the most important trends and sentiments\nDetailed Analysis: Breakdown of themes, customer preferences, and product comparisons\nConclusions and Recommendations: Actionable suggestions based on the analysis\nThese insights can help you understand market sentiment, identify common product issues, or optimize your e-commerce strategy.","step-8-view-and-download-structured-data#Step 8: View and Download Structured Data":"Capalyze presents all extracted data in clean, structured tables. These tables include product titles, star ratings, review texts, and more.You can easily export this data in formats like Excel for further use in reporting, dashboards, or spreadsheets.","step-9-customize-and-download-charts#Step 9: Customize and Download Charts":"Capalyze also auto-generates data visualizations. These include pie charts, bar graphs, and trend lines that visualize customer sentiment, rating distributions, and recurring review themes.All charts are editable and downloadable, making them presentation-ready and highly shareable.","conclusion#Conclusion":"Capalyze is the only analytics tool that combines natural language commands, web scraping, and smart data analysis into a unified workflow. With just a few clicks, users can go from unstructured web data to actionable business insights—no coding required.Try it yourself by visiting https://capalyze.ai. Whether you're in e-commerce, real estate, content creation, or local business management, Capalyze empowers you to make smarter, faster, and more confident decisions with data.","additional-resources#Additional Resources":"Video Tutorial on YouTube: Watch now\nCapalyze on TikTok: Watch short demo\nFollow us on X (formerly Twitter): @Capalyze\nExplore the power of automated data extraction and analysis with Capalyze — your AI agent for smarter decisions."}},"/en/docs":{"title":"Capalyze","data":{"":"Capalyze is the only AI that lets you capture web data across platforms, run sentiment analysis, and automate it all — through natural language.","quick-start#Quick start":"Get started"}},"/en/docs/instagram":{"title":"How to Analyze Instagram Comments with Capalyze: A Complete Tutorial","data":{"introduction#Introduction":"Understanding public sentiment on social platforms like Instagram is critical for brands, influencers, and marketers. But manually analyzing thousands of comments? That’s time-consuming and inefficient.Enter Capalyze — an intelligent data analytics agent that automates both data extraction and sentiment analysis using natural language instructions. In this guide, we’ll show you exactly how to collect and analyze Instagram comments using Capalyze, including generating sentiment polarity charts with no code required.If you're managing social media, running influencer campaigns, or monitoring brand reputation, this tutorial will show you how to turn Instagram conversations into actionable insights in minutes.","step-1-visit-the-capalyze-homepage#Step 1: Visit the Capalyze Homepage":"Start by navigating to https://capalyze.ai in your browser. This is your command center for all things data extraction and analysis.Click “Start Analysis to begin your session.","step-2-enter-your-request-in-natural-language#Step 2: Enter Your Request in Natural Language":"In the chat interface, type the following command:\n\"Collect comments https://www.instagram.com/p/DJ7GUdMR4lk/ sentiment polarity distribution pie chart\"\nThen click Send.Capalyze interprets your intent and prepares the tools needed to extract comments and analyze sentiment.","step-3-install-the-capalyze-chrome-extension#Step 3: Install the Capalyze Chrome Extension":"To enable web data collection from Instagram, Capalyze will prompt you to install its Chrome extension.Click “Go Install”, and you’ll be redirected to the Chrome Web Store. Click Add to Chrome to complete the installation in a single step.This extension allows Capalyze to securely collect data from web pages with minimal user effort.","step-4-automatic-pre-scan-of-instagram-post#Step 4: Automatic Pre-Scan of Instagram Post":"Once the extension is installed, Capalyze immediately begins scanning the Instagram post linked in your request. It detects visible comments and prepares them for preview and extraction.This pre-scan ensures the correct data is targeted before full extraction begins.","step-5-preview-and-confirm-data-collection#Step 5: Preview and Confirm Data Collection":"Back in the Capalyze chat interface, you’ll now see a preview of the first few comments detected on the Instagram post.If everything looks correct, click “Start Extraction” and confirm. Capalyze will begin collecting all available comments in real time.","step-6-monitor-real-time-extraction-progress#Step 6: Monitor Real-Time Extraction Progress":"Capalyze automatically extracts both top-level comments and relevant replies. As the process runs, you'll see the number of collected comments steadily increasing.This transparent approach gives you real-time insight into what's being gathered and how much data has been processed.","step-7-ai-driven-analysis-begins#Step 7: AI-Driven Analysis Begins":"Once data collection is complete, Capalyze automatically transitions into the analysis phase. Comments are organized into a structured spreadsheet format and analyzed for sentiment.This includes determining whether each comment is positive, negative, or neutral.","step-8-explore-key-findings-and-recommendations#Step 8: Explore Key Findings and Recommendations":"Capalyze delivers a multi-layered analytical report that includes:\nKey Findings: Major patterns and sentiment trends\nDetailed Analysis: Insights into audience tone, emotional keywords, and engagement behavior\nConclusions and Recommendations: Practical suggestions based on audience feedback\nThis intelligence can guide content strategy, product tweaks, or PR responses.","step-9-view-sentiment-polarity-and-charts#Step 9: View Sentiment Polarity and Charts":"Capalyze tags every comment with its sentiment classification and visualizes the results in an automatically generated pie chart.The chart shows sentiment polarity distribution — a powerful overview of how people are reacting to your content.","conclusion#Conclusion":"Capalyze removes the friction from collecting and analyzing Instagram comments. With a simple prompt, you can extract real-time feedback, understand audience sentiment, and make faster, data-driven decisions — all from a single platform.Start analyzing Instagram comments today with Capalyze. Whether you're tracking campaign performance or monitoring customer feedback, Capalyze turns raw comments into clear, actionable insights.","additional-resources#Additional Resources":"Video Tutorial: Watch on YouTube\nFollow us on TikTok: @smartdatabrief\nSee updates on X (Twitter): @Capalyze\nCapalyze lets you analyze social media like a pro — no coding, no hassle. Try it now."}},"/en/docs/installation":{"title":"Installation","data":{}},"/en/docs/reddit":{"title":"How to Analyze Reddit Comments with Capalyze: A Step-by-Step Guide (WebDev Post Example)","data":{"introduction#Introduction":"Reddit is a goldmine for community-driven opinions, product feedback, and emerging trends. However, analyzing Reddit threads manually can be time-consuming and imprecise. That’s where Capalyze comes in. Capalyze lets you extract and analyze Reddit comments using simple natural language commands—no coding or data science expertise required.In this tutorial, we’ll walk through how to analyze a Reddit discussion from the r/webdev community. You'll see how Capalyze collects comments, categorizes sentiments, and delivers intelligent insights from an actual Reddit post—all in just a few clicks.","step-1-visit-capalyze-and-start-a-new-chat#Step 1: Visit Capalyze and Start a New Chat":"Open your browser and navigate to https://capalyze.ai. On the homepage, click to start a new conversation.This will open a chat-based interface, where you can type your analysis request.","step-2-enter-the-reddit-url-and-your-request#Step 2: Enter the Reddit URL and Your Request":"In the chat box, type the following:\n“Collect comments https://www.reddit.com/r/webdev/comments/1l2plpn/spent_the_whole_day_on_a_5minute_frontend_tweak/ Analyze the distribution of opinions.”\nThen press Enter. Capalyze will recognize that this is a Reddit URL and prepare to launch its web extraction process.","step-3-install-the-capalyze-chrome-extension#Step 3: Install the Capalyze Chrome Extension":"To proceed with comment extraction, Capalyze will prompt you to install its Chrome extension. Click “Go Install”, and you’ll be redirected to the Chrome Web Store.Install the extension in one click. It enables Capalyze to automatically collect comment data from Reddit and other supported platforms.","step-4-pre-scan-of-reddit-comments#Step 4: Pre-Scan of Reddit Comments":"Once installed, Capalyze will automatically return to the page and initiate a pre-scan of the Reddit thread. It identifies the structure of the post and previews a few initial comments for your review.This step ensures that the data source is valid and structured correctly before full extraction begins.","step-5-launch-the-full-extraction#Step 5: Launch the Full Extraction":"In the chat, you’ll see a preview of sample comments. Click “Start Extraction” and confirm when prompted.Capalyze now begins collecting the entire thread’s comments in real time.","step-6-monitor-live-extraction#Step 6: Monitor Live Extraction":"Capalyze automatically extracts both top-level comments and relevant replies. As the process runs, you'll see the number of collected comments steadily increasing.This transparent approach gives you real-time insight into what's being gathered and how much data has been processed.","step-7-ai-powered-comment-analysis#Step 7: AI-Powered Comment Analysis":"When extraction is complete, Capalyze immediately begins analyzing the data. Using advanced natural language understanding, it reviews each comment and classifies opinions, tones, and themes.You'll see a message like “Analyze the distribution of opinions…” as Capalyze processes the dataset.","step-8-view-key-findings-and-sentiment-distribution#Step 8: View Key Findings and Sentiment Distribution":"Capalyze will generate a structured report that includes:\nKey Findings: Summarized insights about overall sentiment\nDetailed Analysis: Commentary breakdown by emotion, tone, or topic\nConclusions and Recommendations: Actionable insights drawn from the discussion\nIn this example, the system identifies how many users agreed, disagreed, expressed frustration, or shared similar experiences related to a frontend dev task.","step-9-visualize-opinion-distribution#Step 9: Visualize Opinion Distribution":"You’ll also see a breakdown of how different viewpoints are represented across the comments. These categories reflect common themes or perspectives that emerge from the discussion.For each category, representative comments are highlighted to give context and clarity to the opinions expressed.","step-10-download-data-and-export-charts#Step 10: Download Data and Export Charts":"Need to use the raw data? Capalyze presents all extracted comments in a structured table, including usernames, timestamps, and sentiment labels. This dataset can be exported as Excel files.Charts and visuals are also downloadable for use in slide decks, dashboards, or client reports.","conclusion#Conclusion":"Capalyze makes it fast and easy to turn unstructured Reddit discussions into actionable intelligence. From product research to community sentiment analysis, you can now extract and interpret complex discussions with natural language prompts.Start analyzing Reddit threads with Capalyze today. Whether you're in product development, content strategy, or social listening—Capalyze empowers you to work smarter with real-time web data.","additional-resources#Additional Resources":"YouTube: Watch now\nTikTok: Capalyze in Action\nFollow on X: @Capalyze\nUnlock insights from Reddit with just a link — Capalyze does the rest."}},"/en/docs/tiktok":{"title":"How to Analyze TikTok Comments with Capalyze: A Complete Tutorial","data":{"introduction#Introduction":"Understanding public sentiment on social media is a powerful asset for marketers, creators, and brands. TikTok, in particular, offers rich engagement data in the form of video comments—but manually analyzing these comments is time-consuming and inefficient.Capalyze simplifies the entire process with an intelligent, natural language-driven platform that can extract and analyze TikTok comments automatically. In this step-by-step guide, you’ll learn how to use Capalyze to collect and analyze comments from any TikTok video, uncover audience sentiment, and generate meaningful insights in minutes.","step-1-open-capalyze-and-start-a-new-session#Step 1: Open Capalyze and Start a New Session":"Navigate to https://capalyze.ai and click Start Analysis. Capalyze uses a chat-style interface where you can describe your data needs.","step-2-enter-the-tiktok-comment-analysis-request#Step 2: Enter the TikTok Comment Analysis Request":"In the chat box, type:\nCollect comments https://www.tiktok.com/@maviimarketing/video/7503565286616943879 Sentiment Analysis\nThen click Send.Capalyze will understand your intent to extract user comments from a TikTok video and analyze the overall sentiment behind them.","step-3-install-the-chrome-extension#Step 3: Install the Chrome Extension":"For Capalyze to extract data directly from TikTok, you’ll need to install its browser extension. The platform will automatically prompt you—click Go Install to be redirected to the Chrome Web Store.Follow the standard installation process. The extension only needs to be installed once and enables Capalyze to access structured data on any supported webpage.","step-4-automatic-pre-scan-of-tiktok-comments#Step 4: Automatic Pre-Scan of TikTok Comments":"Once the extension is installed, Capalyze begins a pre-scan of the video page. It quickly identifies the data points available for extraction—such as user comments, timestamps, usernames, and likes.No need to configure selectors or write scripts — it’s all handled automatically.","step-5-review-preview-and-start-extraction#Step 5: Review Preview and Start Extraction":"After pre-scanning, Capalyze will display a short preview of the collected comments in the chat. Once you’ve reviewed the sample, click Start Extraction, then Confirm to proceed.Capalyze begins full extraction and displays a real-time progress indicator.","step-6-monitor-real-time-extraction#Step 6: Monitor Real-Time Extraction":"Watch as Capalyze processes and collects hundreds of TikTok comments live from the video page. This ensures transparency and gives you confidence in the completeness of the data being gathered.","step-7-sentiment-analysis-and-ai-powered-insights#Step 7: Sentiment Analysis and AI-Powered Insights":"As soon as extraction completes, Capalyze shifts gears to automated analysis. It classifies each comment by sentiment (positive, neutral, or negative) and synthesizes the text to uncover common patterns, themes, and emotional tone.This AI-driven analysis saves hours of manual reading and categorization.","step-8-view-key-findings-insights-and-recommendations#Step 8: View Key Findings, Insights, and Recommendations":"Capalyze presents its findings in three key sections:\nKey Findings – High-level summaries and sentiment ratios\nDetailed Analysis – Comment breakdowns, frequently used terms, audience emotion\nConclusions & Recommendations – Actionable takeaways based on comment trends\nThis insight is especially useful for content creators, marketers, and brand managers looking to optimize messaging or measure audience reaction.","step-9-explore-sentiment-charts-and-download-data#Step 9: Explore Sentiment Charts and Download Data":"Capalyze automatically generates visual charts that show sentiment distribution across the dataset. You’ll see how many comments are negative, positive, or neutral—and can download this data for reporting.Raw data is also available in structured tables, exportable to Excel for further analysis or integration into dashboards.","conclusion#Conclusion":"Capalyze turns TikTok comment analysis from a tedious manual task into a fully automated, AI-driven workflow. By using natural language commands and browser automation, it bridges the gap between raw social data and meaningful insights.If you're looking to track campaign performance, understand your audience, or monitor brand sentiment, Capalyze makes it simple.Start analyzing TikTok comments today at https://capalyze.ai and experience intelligent social listening with zero code.","additional-resources#Additional Resources":"Watch on YouTube: Video Tutorial\nTikTok Demo: Watch Demo\nFollow Capalyze on X: @Capalyze\nDiscover the power of data-driven decisions, starting with your next TikTok analysis."}},"/en/docs/x":{"title":"How to Analyze X (Twitter) Comments with Capalyze: Elon Musk Tweet Case Study","data":{"introduction#Introduction":"Understanding public sentiment on social media can be crucial for marketers, analysts, researchers, and journalists. Whether you're tracking brand reputation, political reactions, or viral content, the key lies in analyzing conversations at scale—and that's where Capalyze comes in.In this tutorial, we’ll show you how to use Capalyze to extract and analyze comments from a viral post on X (formerly Twitter), using a real example from Elon Musk. With its unique combination of natural language prompts, automated web scraping, and AI-driven insights, Capalyze makes social media sentiment analysis fast, accurate, and code-free.","step-1-visit-capalyze-and-start-a-new-conversation#Step 1: Visit Capalyze and Start a New Conversation":"Begin by navigating to https://capalyze.ai. On the homepage, start a new conversation using the natural language interface.In the chat box, enter:\n“Collect comments https://x.com/elonmusk/status/1928234802135847063 Analyze the distribution of opinions”\nThen press Send. Capalyze will interpret your request and begin the process of gathering relevant data.","step-2-install-the-capalyze-chrome-extension#Step 2: Install the Capalyze Chrome Extension":"To extract data from web pages—including social media posts—Capalyze requires its browser extension. You’ll be prompted to install it after submitting your request.Click “Go Install” to open the Chrome Web Store, then follow the installation instructions. The extension is lightweight and installs in seconds.","step-3-automatic-pre-scan-of-tweet-comments#Step 3: Automatic Pre-Scan of Tweet Comments":"Once the extension is installed, Capalyze automatically begins scanning the comment section of the target tweet. It identifies relevant replies and prepares for full-scale extraction.This pre-scan ensures that only high-value, structured data is collected for analysis.","step-4-review-the-comment-preview-and-start-extraction#Step 4: Review the Comment Preview and Start Extraction":"Return to the Capalyze tab. You’ll see a preview of several user comments Capalyze is ready to extract.Review the preview, then click “Start Extraction” to begin collecting the full dataset. Capalyze will now extract all available replies to the tweet in real time.","step-5-monitor-real-time-data-extraction#Step 5: Monitor Real-Time Data Extraction":"As the extraction progresses, Capalyze displays a real-time status button along with the number of comments being pulled in. This transparency lets you follow the process and confirm data relevance as it happens.","step-6-ai-powered-sentiment-analysis-begins#Step 6: AI-Powered Sentiment Analysis Begins":"Once data collection is complete, Capalyze immediately initiates analysis. Its AI engine reviews the content, interprets sentiment, and begins generating a structured summary of public opinion around the tweet.This step requires no additional input—just let the AI process the data.","step-7-review-the-key-findings-and-insights#Step 7: Review the Key Findings and Insights":"Capalyze delivers a comprehensive set of insights, including:\nKey Findings: Top trends and themes identified in the conversation\nDetailed Analysis: Breakdowns of sentiments (positive, negative, neutral), keyword patterns, and recurring topics\nConclusions and Recommendations: AI-generated summaries that help contextualize the response landscape","step-8-analyze-the-opinion-distribution#Step 8: Analyze the Opinion Distribution":"A core feature of Capalyze’s social media analysis is the opinion distribution breakdown—a clearly structured summary that helps you quickly gauge audience sentiment, from support to criticism.You’ll also see representative comments listed under each sentiment category, giving clear context to every viewpoint.","conclusion#Conclusion":"Capalyze makes social media intelligence accessible to everyone. By turning raw X (Twitter) comments into structured insights, you can better understand what people are saying—and why it matters.Whether you're tracking a political post, analyzing customer feedback, or studying viral trends, Capalyze helps you move from noise to knowledge in minutes.Start your own analysis today at https://capalyze.ai.","additional-resources#Additional Resources":"Watch the Video Tutorial on YouTube: Click here\nSee the Demo on TikTok: Watch on TikTok\nFollow Capalyze on X: @Capalyze\nFrom tweets to trends, Capalyze helps you extract clarity from the conversation."}},"/en":{"title":"Capalyze Docs","data":{}}}